dferbas/NutOs/nut/arch/cm3/dev/stm/stm32_otgd_fs_int.c
  /* Call the user function */
  INTR_RXSTSQLVL_Callback();

  /* Enable the Rx Status Queue Level interrupt */
  MODIFY_REG32( &core_regs.common_regs->int_msk, 0, int_mask.d32);

  /* Clear interrupt: this is a read only bit, it cannot be cleared by register
     access */

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_NPTxFE_ISR
* Description    : Handles the Non Periodic Tx FIFO Empty interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_NPTxFE_ISR(void )
{
  USB_OTG_int_msk_data gintmsk;
  gintmsk.d32 = 0;

  /* Call the user function */
  INTR_NPTXFEMPTY_Callback();

  gintmsk.b.nptxfempty = 1;
  MODIFY_REG32(&core_regs.common_regs->int_msk, gintmsk.d32, 0 );

  /* Clear interrupt: This bit is a read only bit, cannot be cleared
     by register access */
  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_GInNakEff_ISR
* Description    : Handles the Global IN Endpoints NAK Effective interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_GInNakEff_ISR(void)
{

  /* Call user function */
  INTR_GINNAKEFF_Callback();

  /* Clear interrupt: This is a read only bit, it cannot be cleared by register
     access */

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_GOutNakEff_ISR
* Description    : Handles the Global OUT Endpoints NAK Effective interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_GOutNakEff_ISR(void)
{
  /* Call user function */
  INTR_GOUTNAKEFF_Callback();

  /* Clear interrupt: This is a read only bit, it cannot be cleared by register
     access */

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_EarlySuspend_ISR
* Description    : Handles the Early Suspend detected interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_EarlySuspend_ISR(void )
{
  USB_OTG_int_sts_data gintsts;
  USB_OTG_int_msk_data gintmsk;

  gintsts.d32 = 0;
  gintmsk.d32 = 0;


  /* Call user function */
  INTR_ERLYSUSPEND_Callback();

  gintmsk.b.erlysuspend = 1;
  MODIFY_REG32(&core_regs.common_regs->int_msk, gintmsk.d32, 0 );

  /* Clear interrupt */
  gintsts.b.erlysuspend = 1;
  WRITE_REG32(&core_regs.common_regs->int_sts, gintsts.d32);
  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_USBSuspend_ISR
* Description    : Handles the Suspend condition detected interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_USBSuspend_ISR(void)
{
  USB_OTG_int_sts_data gintsts;

  gintsts.d32 = 0;
  /* Call user function */
  INTR_USBSUSPEND_Callback();

  /* Clear interrupt */
  gintsts.b.usbsuspend = 1;
  WRITE_REG32(&core_regs.common_regs->int_sts, gintsts.d32);

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_UsbReset_ISR
* Description    : This interrupt occurs when a USB Reset is detected.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_UsbReset_ISR(void)
{
  USB_OTG_dev_all_int_data daintmsk;
  USB_OTG_dev_out_ep_msk_data doepmsk;
  USB_OTG_dev_in_ep_msk_data diepmsk;
  USB_OTG_dev_cfg_data dcfg;
  USB_OTG_dev_ctl_data dctl;
  USB_OTG_int_sts_data gintsts;

  daintmsk.d32 = 0;
  doepmsk.d32 = 0;
  diepmsk.d32 = 0;
  dcfg.d32 =0;
  dctl.d32 = 0;
  gintsts.d32 = 0;

  /* Clear the Remote Wakeup Signalling */
  dctl.b.rmtwkupsig = 1;
  MODIFY_REG32(&core_regs.dev_regs->dev_ctl, dctl.d32, 0 );

  /* Flush the NP Tx FIFO */
  OTGD_FS_FlushTxFifo( 0 );

  daintmsk.b.inep0 = 1;
  daintmsk.b.outep0 = 1;
  WRITE_REG32( &core_regs.dev_regs->dev_all_int_msk, daintmsk.d32 );

  doepmsk.b.setup = 1;
  doepmsk.b.xfercompl = 1;
  doepmsk.b.ahberr = 1;
  doepmsk.b.epdisabled = 1;
  WRITE_REG32( &core_regs.dev_regs->dev_out_ep_msk, doepmsk.d32 );

  diepmsk.b.xfercompl = 1;
  diepmsk.b.timeout = 1;
  diepmsk.b.epdisabled = 1;
  diepmsk.b.ahberr = 1;
  diepmsk.b.intknepmis = 1;
  WRITE_REG32( &core_regs.dev_regs->dev_in_ep_msk, diepmsk.d32 );

  /* Reset Device Address */
  dcfg.d32 = READ_REG32( &core_regs.dev_regs->dev_cfg);
  dcfg.b.devaddr = 0;
  WRITE_REG32( &core_regs.dev_regs->dev_cfg, dcfg.d32);

  /* setup EP0 to receive SETUP packets */
  OTGD_FS_PCD_EP0_OutStart();

  /* Clear interrupt */
  gintsts.d32 = 0;
  gintsts.b.usbreset = 1;
  WRITE_REG32 (&core_regs.common_regs->int_sts, gintsts.d32);

  /* Call the user reset function */
  OTGD_FS_DEVICE_RESET;

  /* Call user function */
  INTR_USBRESET_Callback();

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_EnumDone_ISR
* Description    : Reads the device status register and set the device speed
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_EnumDone_ISR(void)
{
  USB_OTG_int_sts_data gintsts;
  USB_OTG_usb_cfg_data gusbcfg;

