dferbas/NutOs/nut/arch/cm3/dev/stm/stm32_otgd_fs_int.c
  gintsts.d32 = 0;
  gusbcfg.d32 = 0;

  OTGD_FS_EP0Activate();

  /* Set USB turnaround time based on device speed and PHY interface. */
  gusbcfg.d32 = READ_REG32(&core_regs.common_regs->usb_cfg);

  /* Full or low speed */
  if ( OTGD_FS_PCD_GetDeviceSpeed() == USB_SPEED_FULL)
  {
    gusbcfg.b.usbtrdtim = 9;
  }
  WRITE_REG32(&core_regs.common_regs->usb_cfg, gusbcfg.d32);

  /* Call user function */
  INTR_ENUMDONE_Callback();

  /* Clear interrupt */
  gintsts.b.enumdone = 1;
  WRITE_REG32( &core_regs.common_regs->int_sts, gintsts.d32 );
  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_IsoOutDrop_ISR
* Description    : Handles the Isochrounous Out packet Dropped interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_IsoOutDrop_ISR(void)
{
  USB_OTG_int_sts_data gintsts;

  gintsts.d32 = 0;
  /* Call user function */
  INTR_ISOOUTDROP_Callback();

  /* Clear interrupt */
  gintsts.b.isooutdrop = 1;
  WRITE_REG32(&core_regs.common_regs->int_sts, gintsts.d32);

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_EOPF_ISR
* Description    : Handles the Expexted End Of Periodic Frame interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_EOPF_ISR(void )
{
  USB_OTG_int_sts_data gintsts;
  USB_OTG_int_msk_data gintmsk;

  gintsts.d32 = 0;
  gintmsk.d32 = 0;

  gintmsk.b.eopframe = 1;
  MODIFY_REG32(&core_regs.common_regs->int_msk, gintmsk.d32, 0 );

  /* Call user function */
  INTR_EOPFRAME_Callback();

  /* Clear interrupt */
  gintsts.b.eopframe = 1;
  WRITE_REG32(&core_regs.common_regs->int_sts, gintsts.d32);
  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_EPMismatch_ISR
* Description    : Handles the Endpoint Mismatch error interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_EPMismatch_ISR(void)
{
  USB_OTG_int_sts_data gintsts;

  gintsts.d32 = 0;

  /* Call user function */
  INTR_EPMISMATCH_Callback();

  /* Clear interrupt */
  gintsts.b.epmismatch = 1;
  WRITE_REG32(&core_regs.common_regs->int_sts, gintsts.d32);

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_InEP_ISR
* Description    : Handles all IN endpoints interrupts.
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_InEP_ISR(void)
{
  USB_OTG_dev_in_ep_int_data diepint;

  uint32_t ep_intr = 0;
  uint32_t epnum = 0;
  USB_OTG_EP *ep;
  uint32_t fifoemptymsk = 0;

  diepint.d32 = 0;
  ep_intr = OTGD_FS_ReadDevAllInEPItr();
  while ( ep_intr )
  {
    if (ep_intr&0x1) /* In ITR */
    {
      ep = OTGD_FS_PCD_GetInEP(epnum);
      diepint.d32 = OTGD_FS_PCD_ReadDevInEP(ep); /* Get In ITR status */
      if ( diepint.b.xfercompl )
      {
        fifoemptymsk = 0x1 << ep->num;
        MODIFY_REG32(&core_regs.dev_regs->dev_fifo_empty_msk, fifoemptymsk, 0);

        /* Clear the Interrupt flag */
        CLEAR_IN_EP_INTR(epnum, xfercompl);

        if (epnum == 0)
        {
          /* Call the core IN process for EP0 */
          In0_Process();

          /* before terminate set Tx & Rx status */
          OTG_DEV_SetEPRxStatus(epnum, SaveRState);
          OTG_DEV_SetEPTxStatus(epnum, SaveTState);
        }
        else
        {
          OTG_DEV_SetEPTxStatus((epnum | 0x80 ), DEV_EP_TX_NAK);

          (*pEpInt_IN[epnum -1])();

          /* Toggle Endpoint frame ID */
          if (ep->even_odd_frame == 0)
            ep->even_odd_frame = 1;
          else
            ep->even_odd_frame = 0;
        }
      }
      if ( diepint.b.ahberr )
      {
        CLEAR_IN_EP_INTR(epnum, ahberr);
      }
      if ( diepint.b.timeout )
      {
        CLEAR_IN_EP_INTR(epnum, timeout);
      }
      if (diepint.b.intktxfemp)
      {
        CLEAR_IN_EP_INTR(epnum, intktxfemp);
      }
      if (diepint.b.intknepmis)
      {
        CLEAR_IN_EP_INTR(epnum, intknepmis);
      }
      if (diepint.b.inepnakeff)
      {
        CLEAR_IN_EP_INTR(epnum, inepnakeff);
      }
      if (diepint.b.emptyintr)
      {
         if ((epnum == 0) || (OTG_DEV_GetEPTxStatus(epnum) == DEV_EP_TX_VALID))
        {
          OTGD_FS_PCD_WriteEmptyTxFifo(epnum);
        }

        CLEAR_IN_EP_INTR(epnum, emptyintr);
      }
      if ( diepint.b.epdisabled )
      {
        /* Reset Endpoint Frame ID to 0 */
        ep->even_odd_frame = 0;

        CLEAR_IN_EP_INTR(epnum, epdisabled);
      }
    }
    epnum++;
    ep_intr >>= 1;
  }

  /* Call user function */
  INTR_INEPINTR_Callback();

  return 1;
}


/*******************************************************************************
* Function Name  : OTGD_FS_Handle_OutEP_ISR
* Description    : Handles all OUT endpoints interrupts.
* Input          : None
* Output         : None
* Return         : Status
*******************************************************************************/
uint32_t OTGD_FS_Handle_OutEP_ISR(void)
{
  uint32_t ep_intr = 0;
  USB_OTG_dev_out_ep_int_data doepint;
  uint32_t epnum = 0;
  USB_OTG_EP *ep;

  doepint.d32 = 0;

  /* Read in the device interrupt bits */
  ep_intr = OTGD_FS_ReadDevAllOutEp_itr();

  while ( ep_intr )
  {
    if (ep_intr&0x1)
    {
      /* Get EP pointer */
      ep = OTGD_FS_PCD_GetOutEP(epnum);
      doepint.d32 = OTGD_FS_ReadDevOutEP_itr(ep);

      /* Transfer complete */
      if ( doepint.b.xfercompl )
      {
        /* Clear the bit in DOEPINTn for this interrupt */
        CLEAR_OUT_EP_INTR(epnum, xfercompl);

