dferbas/NutOs/nut/arch/cm3/dev/stm/stm32_otgd_fs_int.c
        if (epnum == 0)
        {
          /* Call the OUT process for the EP0 */
          Out0_Process();
        }
        else
        {
          (*pEpInt_OUT[epnum-1])();
        }
      }
      /* Endpoint disable  */
      if ( doepint.b.epdisabled )
      {
        /* Clear the bit in DOEPINTn for this interrupt */
        CLEAR_OUT_EP_INTR(epnum, epdisabled);
      }
      /* AHB Error */
      if ( doepint.b.ahberr )
      {
        CLEAR_OUT_EP_INTR(epnum, ahberr);
      }
      /* Setup Phase Done (control EPs) */
      if ( doepint.b.setup )
      {
        if (epnum == 0)
        {
          /* Call the SETUP process for the EP0 */
          Setup0_Process();

          /* Before exit, update the Tx status */
          OTG_DEV_SetEPTxStatus(0x80, SaveTState);
        }
        else
        {
          /* Other control endpoints */
        }

        /* Clear the EP Interrupt */
        CLEAR_OUT_EP_INTR(epnum, setup);
      }
    }
    epnum++;
    ep_intr >>= 1;
  }

  /* Call user function */
  INTR_OUTEPINTR_Callback();

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_IncomplIsoIn_ISR
* Description    : Handles the Incomplete Isochrous IN tranfer error interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_IncomplIsoIn_ISR(void)
{
  USB_OTG_int_sts_data gintsts;

  gintsts.d32 = 0;

  /* Call user function */
  INTR_INCOMPLISOIN_Callback();

  /* Clear interrupt */
  gintsts.b.incomplisoin = 1;
  WRITE_REG32(&core_regs.common_regs->int_sts, gintsts.d32);

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_IncomplIsoOut_ISR
* Description    : Handles the Incomplete Isochrous OUT tranfer error interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_IncomplIsoOut_ISR(void)
{
  USB_OTG_int_sts_data gintsts;

  gintsts.d32 = 0;

  /* Call user function */
  INTR_INCOMPLISOOUT_Callback();

  /* Clear interrupt */
  gintsts.b.outepintr = 1;
  WRITE_REG32(&core_regs.common_regs->int_sts, gintsts.d32);

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_Handle_Wakeup_ISR
* Description    : Handles the Wakeup or Remote Wakeup detected interrupt.
* Input          : None
* Output         : None
* Return         : status
*******************************************************************************/
uint32_t OTGD_FS_Handle_Wakeup_ISR(void)
{
  USB_OTG_int_sts_data gintsts;

  gintsts.d32 = 0;
  /* Call user function */
  INTR_WKUPINTR_Callback();

  /* Clear interrupt */
  gintsts.b.wkupintr = 1;
  WRITE_REG32 (&core_regs.common_regs->int_sts, gintsts.d32);

  return 1;
}

/*******************************************************************************
* Function Name  : OTGD_FS_PCD_GetDeviceSpeed
* Description    : Get the device speed from the device status register
* Input          : None
* Output         : None
* Return         : The Device speed value.
*******************************************************************************/
static enum usb_device_speed OTGD_FS_PCD_GetDeviceSpeed(void)
{
  USB_OTG_dev_sts_data dsts;
  enum usb_device_speed speed = USB_SPEED_UNKNOWN;

  dsts.d32 = 0;

  dsts.d32 = READ_REG32(&core_regs.dev_regs->dev_sts);

  switch (dsts.b.enumspd)
  {
    case DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ:
      speed = USB_SPEED_HIGH;
      break;
    case DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ:
    case DSTS_ENUMSPD_FS_PHY_48MHZ:
      speed = USB_SPEED_FULL;
      break;

    case DSTS_ENUMSPD_LS_PHY_6MHZ:
      speed = USB_SPEED_LOW;
      break;
  }

  return speed;
}

/*******************************************************************************
* Function Name  : OTGD_FS_PCD_ReadDevInEP
* Description    : Reads all the Endpoints flags.
* Input          : None
* Output         : None
* Return         : Status
*******************************************************************************/
static uint32_t OTGD_FS_PCD_ReadDevInEP( USB_OTG_EP *ep)
{
  uint32_t v = 0, msk = 0, emp=0;

  msk = READ_REG32(&core_regs.dev_regs->dev_in_ep_msk);
  emp = READ_REG32(&core_regs.dev_regs->dev_fifo_empty_msk);
  msk |= ((emp >> ep->num) & 0x1) << 7;
  v = READ_REG32(&core_regs.inep_regs[ep->num]->dev_in_ep_int) & msk;

  return v;
}

/*******************************************************************************
* Function Name  : OTGD_FS_PCD_WriteEmptyTxFifo
* Description    : Checks Fifo for the next packet to be loaded.
* Input          : None
* Output         : None
* Return         : Status
*******************************************************************************/
static uint32_t OTGD_FS_PCD_WriteEmptyTxFifo(uint32_t epnum)
{
  USB_OTG_dev_tx_fifo_sts_data txstatus;
  USB_OTG_EP *ep;
  uint32_t len = 0;
  uint32_t dwords = 0;
  USB_OTG_dev_ep_ctl_data  depctl;


  txstatus.d32 = 0;
  depctl.d32 = 0;

  ep = OTGD_FS_PCD_GetInEP(epnum);

  len = ep->xfer_len - ep->xfer_count;

  if (len > ep->maxpacket)
  {
    len = ep->maxpacket;
  }

  dwords = (len + 3) / 4;
  txstatus.d32 = READ_REG32( &core_regs.inep_regs[epnum]->dev_tx_fifo_sts);

  /* Manage the case of 0-length data packets toggling data PID */
  if ((ep->xfer_len == 0) && (ep->xfer_count == 0))
  {
    if (ep->num > 0)
    {
      depctl.d32 = READ_REG32( &core_regs.inep_regs[epnum]->dev_in_ep_ctl);
      if (ep->even_odd_frame == 1)
      {
        depctl.b.setd0pid = 0;
        depctl.b.setd1pid = 1;
      }
      else
      {
        depctl.b.setd0pid = 1;
        depctl.b.setd1pid = 0;
      }
      WRITE_REG32( &core_regs.inep_regs[epnum]->dev_in_ep_ctl, depctl.d32);
    }
  }


  while  ((txstatus.b.txfspcavail > dwords) &&
          (ep->xfer_count < ep->xfer_len) &&
          (ep->xfer_len) != 0)
  {
    if (ep->num > 0)
    {
      depctl.d32 = READ_REG32( &core_regs.inep_regs[epnum]->dev_in_ep_ctl);
      if (ep->even_odd_frame == 0)
      {
        depctl.b.setd0pid = 1;
        depctl.b.setd1pid = 0;
      }
      else
      {
        depctl.b.setd0pid = 0;
        depctl.b.setd1pid = 1;
      }
      WRITE_REG32( &core_regs.inep_regs[epnum]->dev_in_ep_ctl, depctl.d32);
    }

    /* Write the FIFO */
    len = ep->xfer_len - ep->xfer_count;

    if (len > ep->maxpacket)
    {
      len = ep->maxpacket;
    }
    dwords = (len + 3) / 4;

    OTGD_FS_WritePacket(ep->xfer_buff, epnum, len);

    ep->xfer_count += len;
    ep->xfer_buff += len;

    txstatus.d32 = READ_REG32(&core_regs.inep_regs[epnum]->dev_tx_fifo_sts);
  }

  return 1;
}
/******************* (C) COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/
